Revit 2026 API

# EnergyDataSettingsUseHeatingCredits Property

---

If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool UseHeatingCredits { get; set; }
```
```vb
Public Property UseHeatingCredits As Boolean
	Get
	Set
```
```cpp
public:
property bool UseHeatingCredits {
	bool get ();
	void set (bool value);
}
```
```fsharp
member UseHeatingCredits : bool with get, set
```

#### Property Value

Boolean

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace